
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяМатериалы.Материал,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Дата,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер
	|ИЗ
	|	Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
	
	|ГДЕ
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер = &НомерНакладной";
	
Запрос.УстановитьПараметр("НомерНакладной", "000000001");

РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();

Пока Выборка.Следующий() Цикл
	
	Сообщить("Материал: " + Выборка.Материал + " Дата: " + Выборка.Дата + " Номер: " + Выборка.Номер);
	
КонецЦикла;


КонецПроцедуры
